ArduPilot/ardupilot/sam_config/STM32H743.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>QUADSPI</name>
      <description>QUADSPI</description>
      <groupName>QUADSPI</groupName>
      <baseAddress>0x52005000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>QUADSPI</name>
        <description>QuadSPI global interrupt</description>
        <value>92</value>
      </interrupt>
      <registers>
        <register>
          <name>CR</name>
          <displayName>CR</displayName>
          <description>QUADSPI control register</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>EN</name>
              <description>Enable Enable the QUADSPI.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ABORT</name>
              <description>Abort request This bit aborts the
              on-going command sequence. It is automatically reset
              once the abort is complete. This bit stops the
              current transfer. In polling mode or memory-mapped
              mode, this bit also reset the APM bit or the DM
              bit.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DMAEN</name>
              <description>DMA enable In indirect mode, DMA can be
              used to input or output data via the QUADSPI_DR
              register. DMA transfers are initiated when the FIFO
              threshold flag, FTF, is set.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TCEN</name>
              <description>Timeout counter enable This bit is valid
              only when memory-mapped mode (FMODE = 11) is
              selected. Activating this bit causes the chip select
              (nCS) to be released (and thus reduces consumption)
              if there has not been an access after a certain
              amount of time, where this time is defined by
              TIMEOUT[15:0] (QUADSPI_LPTR). Enable the timeout
              counter. By default, the QUADSPI never stops its
              prefetch operation, keeping the previous read
              operation active with nCS maintained low, even if no
              access to the Flash memory occurs for a long time.
              Since Flash memories tend to consume more when nCS is
              held low, the application might want to activate the
              timeout counter (TCEN = 1, QUADSPI_CR[3]) so that nCS
              is released after a period of TIMEOUT[15:0]
              (QUADSPI_LPTR) cycles have elapsed without an access
              since when the FIFO becomes full with prefetch data.
              This bit can be modified only when BUSY =
              0.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SSHIFT</name>
              <description>Sample shift By default, the QUADSPI
              samples data 1/2 of a CLK cycle after the data is
              driven by the Flash memory. This bit allows the data
              is to be sampled later in order to account for
              external signal delays. Firmware must assure that
              SSHIFT = 0 when in DDR mode (when DDRM = 1). This
              field can be modified only when BUSY =
              0.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DFM</name>
              <description>Dual-flash mode This bit activates
              dual-flash mode, where two external Flash memories
              are used simultaneously to double throughput and
              capacity. This bit can be modified only when BUSY =
              0.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FSEL</name>
              <description>Flash memory selection This bit selects
              the Flash memory to be addressed in single flash mode
              (when DFM = 0). This bit can be modified only when
              BUSY = 0. This bit is ignored when DFM =
              1.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FTHRES</name>
              <description>FIFO threshold level Defines, in
              indirect mode, the threshold number of bytes in the
              FIFO that will cause the FIFO threshold flag (FTF,
              QUADSPI_SR[2]) to be set. In indirect write mode
              (FMODE = 00): ... In indirect read mode (FMODE = 01):
              ... If DMAEN = 1, then the DMA controller for the
              corresponding channel must be disabled before
              changing the FTHRES value.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>TEIE</name>
              <description>Transfer error interrupt enable This bit
              enables the transfer error interrupt.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TCIE</name>
              <description>Transfer complete interrupt enable This
              bit enables the transfer complete
              interrupt.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FTIE</name>
              <description>FIFO threshold interrupt enable This bit
              enables the FIFO threshold interrupt.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SMIE</name>
              <description>Status match interrupt enable This bit
              enables the status match interrupt.</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TOIE</name>
              <description>TimeOut interrupt enable This bit
              enables the TimeOut interrupt.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>APMS</name>
              <description>Automatic poll mode stop This bit
              determines if automatic polling is stopped after a
              match. This bit can be modified only when BUSY =
              0.</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PMM</name>
              <description>Polling match mode This bit indicates
              which method should be used for determining a match
              during automatic polling mode. This bit can be
              modified only when BUSY = 0.</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PRESCALER</name>
              <description>clock prescaler</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DCR</name>
          <displayName>DCR</displayName>
          <description>QUADSPI device configuration
          register</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CKMODE</name>
              <description>indicates the level that clk takes
              between command</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CSHT</name>
              <description>Chip select high time CSHT+1 defines the
              minimum number of CLK cycles which the chip select
              (nCS) must remain high between commands issued to the
              Flash memory. ... This field can be modified only
              when BUSY = 0.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>FSIZE</name>
              <description>Flash memory size This field defines the
              size of external memory using the following formula:
              Number of bytes in Flash memory = 2[FSIZE+1] FSIZE+1
              is effectively the number of address bits required to
              address the Flash memory. The Flash memory capacity
              can be up to 4GB (addressed using 32 bits) in
              indirect mode, but the addressable space in
              memory-mapped mode is limited to 256MB. If DFM = 1,
              FSIZE indicates the total capacity of the two Flash
              memories together. This field can be modified only
              when BUSY = 0.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SR</name>
          <displayName>SR</displayName>
          <description>QUADSPI status register</description>
          <addressOffset>0x8</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TEF</name>
              <description>Transfer error flag This bit is set in
              indirect mode when an invalid address is being
              accessed in indirect mode. It is cleared by writing 1
              to CTEF.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TCF</name>
              <description>Transfer complete flag This bit is set
              in indirect mode when the programmed number of data
              has been transferred or in any mode when the transfer
              has been aborted.It is cleared by writing 1 to
              CTCF.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FTF</name>
              <description>FIFO threshold flag In indirect mode,
              this bit is set when the FIFO threshold has been
              reached, or if there is any data left in the FIFO
              after reads from the Flash memory are complete. It is
              cleared automatically as soon as threshold condition
              is no longer true. In automatic polling mode this bit
              is set every time the status register is read, and
              the bit is cleared when the data register is
              read.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SMF</name>
              <description>Status match flag This bit is set in
              automatic polling mode when the unmasked received
              data matches the corresponding bits in the match
              register (QUADSPI_PSMAR). It is cleared by writing 1
              to CSMF.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TOF</name>
              <description>Timeout flag This bit is set when
              timeout occurs. It is cleared by writing 1 to
              CTOF.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BUSY</name>
              <description>Busy This bit is set when an operation
              is on going. This bit clears automatically when the
              operation with the Flash memory is finished and the
              FIFO is empty.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLEVEL</name>
              <description>FIFO level This field gives the number
              of valid bytes which are being held in the FIFO.
              FLEVEL = 0 when the FIFO is empty, and 16 when it is
              full. In memory-mapped mode and in automatic status
              polling mode, FLEVEL is zero.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FCR</name>
          <displayName>FCR</displayName>
          <description>QUADSPI flag clear register</description>
          <addressOffset>0xC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CTEF</name>
              <description>Clear transfer error flag Writing 1
              clears the TEF flag in the QUADSPI_SR
              register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CTCF</name>
              <description>Clear transfer complete flag Writing 1
              clears the TCF flag in the QUADSPI_SR
              register</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CSMF</name>
              <description>Clear status match flag Writing 1 clears
              the SMF flag in the QUADSPI_SR register</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CTOF</name>
              <description>Clear timeout flag Writing 1 clears the
              TOF flag in the QUADSPI_SR register</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DLR</name>
          <displayName>DLR</displayName>
          <description>QUADSPI data length register</description>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DL</name>
              <description>Data length Number of data to be
              retrieved (value+1) in indirect and status-polling
              modes. A value no greater than 3 (indicating 4 bytes)
              should be used for status-polling mode. All 1s in
              indirect mode means undefined length, where QUADSPI
              will continue until the end of memory, as defined by
              FSIZE. 0x0000_0000: 1 byte is to be transferred
              0x0000_0001: 2 bytes are to be transferred
              0x0000_0002: 3 bytes are to be transferred
              0x0000_0003: 4 bytes are to be transferred ...
              0xFFFF_FFFD: 4,294,967,294 (4G-2) bytes are to be
              transferred 0xFFFF_FFFE: 4,294,967,295 (4G-1) bytes
              are to be transferred 0xFFFF_FFFF: undefined length
              -- all bytes until the end of Flash memory (as
              defined by FSIZE) are to be transferred. Continue
              reading indefinitely if FSIZE = 0x1F. DL[0] is stuck
              at 1 in dual-flash mode (DFM = 1) even when 0 is
              written to this bit, thus assuring that each access
              transfers an even number of bytes. This field has no
              effect when in memory-mapped mode (FMODE = 10). This
              field can be written only when BUSY =
              0.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CCR</name>
          <displayName>CCR</displayName>
          <description>QUADSPI communication configuration
          register</description>
          <addressOffset>0x14</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>INSTRUCTION</name>
              <description>Instruction Instruction to be send to
              the external SPI device. This field can be written
              only when BUSY = 0.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>IMODE</name>
              <description>Instruction mode This field defines the
              instruction phase mode of operation: This field can
              be written only when BUSY = 0.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>ADMODE</name>
              <description>Address mode This field defines the
              address phase mode of operation: This field can be
              written only when BUSY = 0.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>ADSIZE</name>
              <description>Address size This bit defines address
              size: This field can be written only when BUSY =
              0.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>ABMODE</name>
              <description>Alternate bytes mode This field defines
              the alternate-bytes phase mode of operation: This
              field can be written only when BUSY =
              0.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>ABSIZE</name>
              <description>Alternate bytes size This bit defines
              alternate bytes size: This field can be written only
              when BUSY = 0.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>DCYC</name>
              <description>Number of dummy cycles This field
              defines the duration of the dummy phase. In both SDR
              and DDR modes, it specifies a number of CLK cycles
              (0-31). This field can be written only when BUSY =
              0.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>DMODE</name>
              <description>Data mode This field defines the data
              phases mode of operation: This field also determines
              the dummy phase mode of operation. This field can be
              written only when BUSY = 0.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>FMODE</name>
              <description>Functional mode This field defines the
              QUADSPI functional mode of operation. If DMAEN = 1
              already, then the DMA controller for the
              corresponding channel must be disabled before
              changing the FMODE value. This field can be written
              only when BUSY = 0.</description>
              <bitOffset>26</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>SIOO</name>
              <description>Send instruction only once mode See
              Section15.3.11: Sending the instruction only once on
              page13. This bit has no effect when IMODE = 00. This
              field can be written only when BUSY =
              0.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DHHC</name>
              <description>DDR hold Delay the data output by 1/4 of
              the QUADSPI output clock cycle in DDR mode: This
              feature is only active in DDR mode. This field can be
              written only when BUSY = 0.</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DDRM</name>
              <description>Double data rate mode This bit sets the
              DDR mode for the address, alternate byte and data
              phase: This field can be written only when BUSY =
              0.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>AR</name>
          <displayName>AR</displayName>
          <description>QUADSPI address register</description>
          <addressOffset>0x18</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ADDRESS</name>
              <description>[31 0]: Address Address to be send to
              the external Flash memory Writes to this field are
              ignored when BUSY = 0 or when FMODE = 11
              (memory-mapped mode). In dual flash mode, ADDRESS[0]
              is automatically stuck to 0 as the address should
              always be even</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ABR</name>
          <displayName>ABR</displayName>
          <description>QUADSPI alternate bytes
          registers</description>
          <addressOffset>0x1C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ALTERNATE</name>
              <description>Alternate Bytes Optional data to be send
              to the external SPI device right after the address.
              This field can be written only when BUSY =
              0.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
