ArduPilot/ardupilot/sam_config/STM32H743.svd
		<register>
          <name>OPTSR_CUR</name>
          <displayName>OPTSR_CUR</displayName>
          <description>FLASH option status register</description>
          <addressOffset>0x1C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>OPT_BUSY</name>
              <description>Option byte change ongoing
              flag</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BOR_LEV</name>
              <description>Brownout level option status
              bit</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>IWDG1_SW</name>
              <description>IWDG1 control option status
              bit</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>NRST_STOP_D1</name>
              <description>D1 DStop entry reset option status
              bit</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>NRST_STBY_D1</name>
              <description>D1 DStandby entry reset option status
              bit</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RDP</name>
              <description>Readout protection level option status
              byte</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>IWDG_FZ_STOP</name>
              <description>IWDG Stop mode freeze option status
              bit</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IWDG_FZ_SDBY</name>
              <description>IWDG Standby mode freeze option status
              bit</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ST_RAM_SIZE</name>
              <description>DTCM RAM size option
              status</description>
              <bitOffset>19</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>SECURITY</name>
              <description>Security enable option status
              bit</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IO_HSLV</name>
              <description>I/O high-speed at low-voltage status bit
              (PRODUCT_BELOW_25V)</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OPTCHANGEERR</name>
              <description>Option byte change error
              flag</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SWAP_BANK_OPT</name>
              <description>Bank swapping option status
              bit</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>            
        <register>
          <name>OPTSR_PRG</name>
          <displayName>OPTSR_PRG</displayName>
          <description>FLASH option status register</description>
          <addressOffset>0x20</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BOR_LEV</name>
              <description>BOR reset level option configuration
              bits</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>IWDG1_SW</name>
              <description>IWDG1 option configuration
              bit</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>NRST_STOP_D1</name>
              <description>Option byte erase after D1 DStop option
              configuration bit</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>NRST_STBY_D1</name>
              <description>Option byte erase after D1 DStandby
              option configuration bit</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RDP</name>
              <description>Readout protection level option
              configuration byte</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>IWDG_FZ_STOP</name>
              <description>IWDG Stop mode freeze option
              configuration bit</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IWDG_FZ_SDBY</name>
              <description>IWDG Standby mode freeze option
              configuration bit</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ST_RAM_SIZE</name>
              <description>DTCM size select option configuration
              bits</description>
              <bitOffset>19</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>SECURITY</name>
              <description>Security option configuration
              bit</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>                      
            <field>
              <name>IO_HSLV</name>
              <description>I/O high-speed at low-voltage
              (PRODUCT_BELOW_25V)</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SWAP_BANK_OPT</name>
              <description>Bank swapping option configuration
              bit</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>           
        <register>
          <name>OPTCCR</name>
          <displayName>OPTCCR</displayName>
          <description>FLASH option clear control
          register</description>
          <addressOffset>0x24</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CLR_OPTCHANGEERR</name>
              <description>OPTCHANGEERR reset bit</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>		
        <register>
          <name>PRAR_CUR1</name>
          <displayName>PRAR_CUR1</displayName>
          <description>FLASH protection address for bank
          1</description>
          <addressOffset>0x28</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PROT_AREA_START1</name>
              <description>Bank 1 lowest PCROP protected
              address</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
            <field>
              <name>PROT_AREA_END1</name>
              <description>Bank 1 highest PCROP protected
              address</description>
              <bitOffset>16</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
            <field>
              <name>DMEP1</name>
              <description>Bank 1 PCROP protected erase enable
              option status bit</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PRAR_PRG1</name>
          <displayName>PRAR_PRG1</displayName>
          <description>FLASH protection address for bank
          1</description>
          <addressOffset>0x2C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PROT_AREA_START1</name>
              <description>Bank 1 lowest PCROP protected address
              configuration</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
            <field>
              <name>PROT_AREA_END1</name>
              <description>Bank 1 highest PCROP protected address
              configuration</description>
              <bitOffset>16</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
            <field>
              <name>DMEP1</name>
              <description>Bank 1 PCROP protected erase enable
              option configuration bit</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SCAR_CUR1</name>
          <displayName>SCAR_CUR1</displayName>
          <description>FLASH secure address for bank
          1</description>
          <addressOffset>0x30</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SEC_AREA_START1</name>
              <description>Bank 1 lowest secure protected
              address</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
            <field>
              <name>SEC_AREA_END1</name>
              <description>Bank 1 highest secure protected
              address</description>
              <bitOffset>16</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
            <field>
              <name>DMES1</name>
              <description>Bank 1 secure protected erase enable
              option status bit</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SCAR_PRG1</name>
          <displayName>SCAR_PRG1</displayName>
          <description>FLASH secure address for bank
          1</description>
          <addressOffset>0x34</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SEC_AREA_START1</name>
              <description>Bank 1 lowest secure protected address
              configuration</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
            <field>
              <name>SEC_AREA_END1</name>
              <description>Bank 1 highest secure protected address
              configuration</description>
              <bitOffset>16</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
            <field>
              <name>DMES1</name>
              <description>Bank 1 secure protected erase enable
              option configuration bit</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>WPSN_CUR1R</name>
          <displayName>WPSN_CUR1R</displayName>
          <description>FLASH write sector protection for bank
          1</description>
          <addressOffset>0x38</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>WRPSn1</name>
              <description>Bank 1 sector write protection option
              status byte</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>WPSN_PRG1R</name>
          <displayName>WPSN_PRG1R</displayName>
          <description>FLASH write sector protection for bank
          1</description>
          <addressOffset>0x3C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>WRPSn1</name>
              <description>Bank 1 sector write protection
              configuration byte</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>BOOT_CURR</name>
          <displayName>BOOT_CURR</displayName>
          <description>FLASH register with boot
          address</description>
          <addressOffset>0x40</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BOOT_ADD0</name>
              <description>Boot address 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
            <field>
              <name>BOOT_ADD1</name>
              <description>Boot address 1</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>BOOT_PRGR</name>
          <displayName>BOOT_PRGR</displayName>
          <description>FLASH register with boot
          address</description>
          <addressOffset>0x44</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BOOT_ADD0</name>
              <description>Boot address 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
            <field>
              <name>BOOT_ADD1</name>
              <description>Boot address 1</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CRCCR1</name>
          <displayName>CRCCR1</displayName>
          <description>FLASH CRC control register for bank
          1</description>
          <addressOffset>0x50</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CRC_SECT</name>
              <description>Bank 1 CRC sector number</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>ALL_BANK</name>
              <description>Bank 1 CRC select bit</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CRC_BY_SECT</name>
              <description>Bank 1 CRC sector mode select
              bit</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ADD_SECT</name>
              <description>Bank 1 CRC sector select
              bit</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CLEAN_SECT</name>
              <description>Bank 1 CRC sector list clear
              bit</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>START_CRC</name>
              <description>Bank 1 CRC start bit</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CLEAN_CRC</name>
              <description>Bank 1 CRC clear bit</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CRC_BURST</name>
              <description>Bank 1 CRC burst size</description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CRCSADD1R</name>
          <displayName>CRCSADD1R</displayName>
          <description>FLASH CRC start address register for bank
          1</description>
          <addressOffset>0x54</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CRC_START_ADDR</name>
              <description>CRC start address on bank 1</description>
              <bitOffset>2</bitOffset>
              <bitWidth>18</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CRCEADD1R</name>
          <displayName>CRCEADD1R</displayName>
          <description>FLASH CRC end address register for bank
          1</description>
          <addressOffset>0x58</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CRC_END_ADDR</name>
              <description>CRC end address on bank 1</description>
              <bitOffset>2</bitOffset>
              <bitWidth>18</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CRCDATAR</name>
          <displayName>CRCDATAR</displayName>
          <description>FLASH CRC data register</description>
          <addressOffset>0x5C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CRC_DATA</name>
              <description>CRC result</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ECC_FA1R</name>
          <displayName>ECC_FA1R</displayName>
          <description>FLASH ECC fail address for bank
          1</description>
          <addressOffset>0x60</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>FAIL_ECC_ADDR1</name>
              <description>Bank 1 ECC error address</description>
              <bitOffset>0</bitOffset>
              <bitWidth>15</bitWidth>
            </field>
          </fields>
        </register>
		<register>
          <name>ACR_</name>
          <displayName>ACR_</displayName>
          <description>Access control register</description>
          <addressOffset>0x100</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000037</resetValue>
          <fields>
            <field>
              <name>LATENCY</name>
              <description>Read latency</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>WRHIGHFREQ</name>
              <description>Flash signal delay</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>KEYR2</name>
          <displayName>KEYR2</displayName>
          <description>FLASH key register for bank 2</description>
          <addressOffset>0x104</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>KEYR2</name>
              <description>Bank 2 access configuration unlock
              key</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
		<register>
          <name>OPTKEYR_</name>
          <displayName>OPTKEYR_</displayName>
          <description>FLASH option key register</description>
          <addressOffset>0x108</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>OPTKEYR</name>
              <description>Unlock key option bytes</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
